import 'price.dart';

class Uniqlo {
  String imageUrl;
  String imgLabel;
  String description;
  double price;

  Uniqlo(this.imageUrl, this.imgLabel, this.description,this.price);

  static List<Uniqlo> samples = 
  [
    Uniqlo('assets/images/11.jpg', 'เสื้อสีน้ำเงินสุดเริศ','เสื้อยืดสีน้ำเงินดีไซน์เรียบหรู ผลิตจากผ้าคุณภาพสูง สวมใส่สบาย ระบายอากาศได้ดี เหมาะสำหรับทุกโอกาส ไม่ว่าจะเป็นลุคชิลล์ในวันหยุดหรือแต่งแบบสุภาพในวันที่ต้องการความเรียบร้อย', 299.0),
    Uniqlo('assets/images/12.jpg', 'กางเกงขายาวสีน้ำตาล','กางเกงขายาวสีน้ำตาลสุดคลาสสิก ผลิตจากผ้าคุณภาพดี ทนทานต่อการใช้งาน มีดีไซน์ที่ทันสมัยและเหมาะกับทุกโอกาส สามารถจับคู่กับเสื้อผ้าหลากหลายสไตล์ได้อย่างลงตัว', 499.0),
    Uniqlo('assets/images/3.jpg', 'เสื้อแขนยาวสีครีม','เสื้อแขนยาวสีครีมสุดนุ่ม ผลิตจากผ้าคุณภาพสูงที่ให้ความอบอุ่นและสบายตัว เหมาะสำหรับสวมใส่ในช่วงฤดูหนาวหรือวันที่อากาศเย็น มีดีไซน์เรียบง่ายแต่ดูดี สามารถจับคู่กับกางเกงหรือกระโปรงได้หลากหลายสไตล์', 599.0),
    Uniqlo('assets/images/4.jpg', 'เสื้อกันหนาว','เสื้อกันหนาวสุดอบอุ่น ผลิตจากวัสดุคุณภาพสูงที่ช่วยเก็บความร้อนและป้องกันลมหนาวได้อย่างมีประสิทธิภาพ มีดีไซน์ทันสมัยและเหมาะสำหรับการสวมใส่ในทุกโอกาส ไม่ว่าจะเป็นการเดินเล่นในเมืองหรือตะลุยกิจกรรมกลางแจ้ง', 699.0),
    Uniqlo('assets/images/5.jpg', 'เสื้อยืดสีขาวลาย pop mart','เสื้อยืดสีขาวลาย pop mart สุดน่ารัก ผลิตจากผ้าคุณภาพดีที่ให้ความนุ่มนวลและสบายตัว มีลายกราฟิกที่สดใสและน่าสนใจ เหมาะสำหรับการสวมใส่ในวันสบายๆ หรือแมตช์กับกางเกงยีนส์เพื่อสร้างลุคที่ดูดีและเป็นกันเอง', 799.0),
  ];
}